EmielV2002/FRDM_MCXx_SensHat/SDK_2_14_2_FRDM-MCXA153/components/i3c_bus/fsl_component_i3c_adapter.c
static void i3c_master_callback(I3C_Type *base, i3c_master_handle_t *handle, status_t status, void *userData)
{
    /* Signal transfer success when received success status. */
    if (status == kStatus_Success)
    {
        g_masterCompletionFlag = true;
    }

    if (status == kStatus_I3C_IBIWon)
    {
        g_ibiWonFlag = true;
    }

    g_completionStatus = status;
}

static status_t I3C_MasterAdapterInit(i3c_device_t *master)
{
    assert(master != NULL);
    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_bus_t *bus                                = master->bus;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;

    I3C_Type *base                       = masterResource->base;
    i3c_master_transfer_mode_t transMode = masterResource->transMode;
    i3c_master_adapter_private_t *masterPrivate;

    i3c_config_t masterConfig;
    I3C_GetDefaultConfig(&masterConfig);
    masterConfig.baudRate_Hz.i2cBaud          = bus->i2cBaudRate;
    masterConfig.baudRate_Hz.i3cPushPullBaud  = bus->i3cPushPullBaudRate;
    masterConfig.baudRate_Hz.i3cOpenDrainBaud = bus->i3cOpenDrainBaudRate;
    masterConfig.enableOpenDrainStop          = false;
    masterConfig.masterDynamicAddress         = master->info.dynamicAddr;
    masterConfig.maxWriteLength               = master->info.maxWriteLength;
    masterConfig.maxReadLength                = master->info.maxReadLength;
    masterConfig.staticAddr                   = master->info.staticAddr;
    masterConfig.vendorID                     = master->info.vendorID;
    masterConfig.partNumber                   = master->info.partNumber;
    masterConfig.dcr                          = master->info.dcr;
    masterConfig.bcr                          = master->info.bcr;
    masterConfig.hdrMode                      = master->info.hdrMode;

    masterPrivate                  = malloc(sizeof(i3c_master_adapter_private_t));
    masterControlInfo->privateData = masterPrivate;

    /* Master is capable of working as master but work as slave for now */
    if (masterControlInfo->isSecondary)
    {
        masterConfig.enableMaster = kI3C_MasterCapable;
        masterConfig.enableSlave  = true;
        masterPrivate->devList    = malloc(I3C_SLAVELIST_MAX_LEN);
        masterPrivate->devCount   = 0U;
        (void)memset((void *)masterPrivate->devList, 0, I3C_SLAVELIST_MAX_LEN);
    }
    else
    {
        masterConfig.enableMaster = kI3C_MasterOn;
        masterConfig.enableSlave  = false;
    }

    I3C_Init(base, &masterConfig, masterResource->clockInHz);

    if (transMode == kI3C_MasterTransferInterruptMode)
    {
        i3c_master_handle_t *g_i3c_m_handle = malloc(sizeof(i3c_master_handle_t));
        I3C_MasterTransferCreateHandle(base, g_i3c_m_handle, &masterCallback, master);
    }

    status_t result = kStatus_Success;

    if (masterControlInfo->isSecondary)
    {
        /* Create slave handle. */
        i3c_slave_handle_t *g_i3c_s_handle = malloc(sizeof(*g_i3c_s_handle));
        I3C_SlaveTransferCreateHandle(base, g_i3c_s_handle, i3c_secondarymaster_callback, master);

        /* Start slave non-blocking transfer. */
        result =
            I3C_SlaveTransferNonBlocking(base, g_i3c_s_handle,
                                         ((uint32_t)kI3C_SlaveCompletionEvent | (uint32_t)kI3C_SlaveReceivedCCCEvent |
                                          (uint32_t)kI3C_SlaveRequestSentEvent));
        I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
    }
    return result;
}

static status_t I3C_MasterAdapterProcessDAA(i3c_device_t *master)
{
    assert(master != NULL);
    status_t result                               = kStatus_Success;
    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;
    uint8_t rxBuffer[8] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU};
    i3c_bus_t *i3cBus   = master->bus;
    bool mctrlDone      = false;
    uint8_t rxSize      = 0;
    uint32_t errStatus;
    uint32_t status;
    size_t rxCount;

    /* Return an error if the bus is already in use not by us. */
    result = I3C_CheckForBusyBus(base);
    if (kStatus_Success != result)
    {
        return result;
    }

    /* Clear all flags. */
    I3C_MasterClearErrorStatusFlags(base, (uint32_t)kI3C_MasterAllErrorFlags);
    I3C_MasterClearStatusFlags(base, (uint32_t)kI3C_MasterClearFlags);

    /* Disable I3C IRQ sources while we configure stuff. */
    uint32_t enabledInts = I3C_MasterGetEnabledInterrupts(base);
    I3C_MasterDisableInterrupts(base, enabledInts);

    /* Emit process DAA */
    I3C_MasterEmitRequest(base, kI3C_RequestProcessDAA);

    do
    {
        status = I3C_MasterGetStatusFlags(base);

        /* Check for error flags. */
        errStatus = I3C_MasterGetErrorStatusFlags(base);
        result    = I3C_MasterCheckAndClearError(base, errStatus);
        if (kStatus_Success != result)
        {
            return result;
        }

        if ((!mctrlDone) || (rxSize < 8U))
        {
            I3C_MasterGetFifoCounts(base, &rxCount, NULL);
            while (rxCount-- != 0U)
            {
                rxBuffer[rxSize++] = (uint8_t)(base->MRDATAB & I3C_MRDATAB_VALUE_MASK);
            }

            if ((status & (uint32_t)kI3C_MasterControlDoneFlag) != 0U)
            {
                I3C_MasterClearStatusFlags(base, (uint32_t)kI3C_MasterControlDoneFlag);
                mctrlDone = true;
            }
        }
        else if ((I3C_MasterGetState(base) == kI3C_MasterStateDaa) &&
            (0UL != (I3C_MasterGetStatusFlags(base) & (uint32_t)kI3C_MasterBetweenFlag)))
        {
            uint8_t validAddr = I3C_BusGetValidAddrSlot(i3cBus, 0x0);
            if (validAddr < I3C_BUS_MAX_ADDR)
            {
                /* Assign the dynamic address. */
                base->MWDATAB = validAddr;
                /* Emit process DAA again. */
                I3C_MasterEmitRequest(base, kI3C_RequestProcessDAA);
              
